Ran Plan for dir: `.` workspace: `production`

<details><summary>Show Output</summary>

```diff
module.kubernetes.module.storage.kubernetes_manifest.persistent-volume-3Gi_1: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.kubernetes.module.minio.helm_release.minio must be replaced
-/+ resource "helm_release" "minio" {
      ~ id                         = "minio" -> (known after apply)
      + manifest                   = (known after apply)
      ~ metadata                   = [
          - {
              - app_version = "2024.7.4"
              - chart       = "minio"
              - name        = "minio"
              - namespace   = "default"
              - revision    = 1
              - values      = jsonencode(
                    {
                      - auth              = {
                          - rootPassword = "admin"
                        }
                      - namespaceOverride = "minio"
                      - persistence       = {
                          - size         = "3Gi"
                          - storageClass = "local-storage-class"
                        }
                      - volumePermissions = {
                          - enabled = true
                        }
                    }
                )
              - version     = "14.6.19"
            },
        ] -> (known after apply)
        name                       = "minio"
      ~ status                     = "failed" -> "deployed"
      ~ values                     = [
          - <<-EOT
                namespaceOverride: minio
                auth:
                  rootPassword : admin
                persistence:
                  storageClass: local-storage-class
                  size: 3Gi
                volumePermissions:
                  enabled: true
            EOT,
          + <<-EOT
                namespaceOverride: minio
                auth:
                  rootPassword : minioadmin
                persistence:
                  storageClass: local-storage-class
                  size: 3Gi
                volumePermissions:
                  enabled: true
            EOT,
        ]
      ~ version                    = "14.6.19" -> (known after apply)
        # (24 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -w production`
* :put_litter_in_its_place: To **delete** this plan click [here](http://144.24.128.160:4141/lock?id=1995navinkumar%252Fterraform%252F.%252Fproduction)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -w production`
</details>
Plan: 1 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`